**SQL in Colab using Magic Commands**

Google Colaboratory(aka google colab) is an online notebook environment that runs on Google Cloud

Magic commands are a feature of IPython that provides a set of commands to solve common problems while working with data. SQL magic command is one such command that lets you write SQL Queries in your notebook

In [ ]:
# install ipython-sql
!pip install ipython-sql

In [1]:
# We will first load an sql extension into our environment
# This extension will allow us to work with sql on Colaboratory
%load_ext sql

# We will then connect to our in memory sqlite database
# NB: This database will cease to exist as soon as the database connection is closed.
%sql sqlite://

You can now write SQL queries using the %sql or %%sql magic command. % is for single line commands and %% is for multi-line commands that run the whole cell as SQL

In [2]:
%%sql

CREATE TABLE celebs (
    ID INTEGER,
    name TEXT,
    age INTEGER
);

SELECT * FROM celebs

 * sqlite://
Done.
Done.

[]

In [4]:
%%sql

INSERT INTO celebs(ID, name, age)
VALUES (1, 'J Cole', 36);

 * sqlite://
1 rows affected.

[]

In [5]:
%%sql

SELECT * FROM celebs

 * sqlite://
Done.

[(1, 'J Cole', 36)]